src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикиОтпусков</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПревышениеДнейОтпуска</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ВКМ_ГрафикиОтпусков/ВКМ_ГрафикиОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиОтпусков</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодКонец</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Область ОбработчикиСобытий
#Если НаСервере Тогда

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ВКМ_ГрафикиОтпусков.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка КАК Ссылка,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.НомерСтроки КАК НомерСтроки,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, ДЕНЬ), НАЧАЛОПЕРИОДА(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ), ДЕНЬ)+1 КАК КоличествоДней
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
	|ГДЕ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Движения.ВКМ_ГрафикиОтпусков.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		// регистр ГрафикОтпусков
		Движение = Движения.ВКМ_ГрафикиОтпусков.Добавить();
		Движение.Период = Дата;
		Движение.Год = НачалоГода(Год);
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.ПериодНачало = Выборка.ДатаНачала;
		Движение.ПериодКонец = Выборка.ДатаОкончания;
		Движение.КоличествоДней = Выборка.КоличествоДней;
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры 
#КонецЕсли	
#КонецОбласти
